/* MAIN.C file
 * Дата создания 26.03.2023
 Автор: Никита
 Часы на основе STM8S003F3P6
 * Copyright (c) 2002-2005 STMicroelectronics
 */
 #include "stm8s.h"
unsigned int  ms = 0;//переменная для функции задержки
unsigned char t=0;//Флаг нажатия кнопки

void delay_ms(unsigned int set_ms) // Задержка в мс
{
   ms = set_ms + 300;
	 while (ms--);
}

main()
{
//ODR регистр выходных данных
//IDR регистр входных данных
//DDR регистр направления данных
//Настройка портов
	CLK->CKDIVR = 0b00011111; //Делитель частоты = 8
	GPIOD->DDR |= (1<<6) | (1<<5) | (1<<4) | (1<<3);
	GPIOD->CR1 |= (1<<6) | (1<<5) | (1<<4) | (1<<3);  //Выход типа Push-pull
	GPIOD->CR2 |= (1<<6) | (1<<5) | (1<<4) | (1<<3);  // Скорость переключения - до 10 МГц.
	
	GPIOC->DDR &= ~((1<<4) | (1<<3));//вход
	GPIOC->CR1 |= (1<<4) | (1<<3);//вход с подтягивающим резистором  
	GPIOC->CR2 |= (1<<4) | (1<<3); 
	while (1){
	if ((GPIOC->IDR & (1 << 3)) == 0 ) t = 1;
	if ((GPIOC->IDR & (1 << 4)) == 0 ) t = 0;
	
	if (t == 1){
	GPIOD->ODR |= (1<<5) | (1<<4) | (1<<3);
	delay_ms(1000);
	GPIOD->ODR &=  ~((1<<5) | (1<<4) | (1<<3));
	delay_ms(1000);
	
}

	}
}